# Brewfile - Liste des applications à installer automatiquement

# Outils en ligne de commande
brew "git"
brew "stow"
brew "starship"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "nvm"
brew "ripgrep"
brew "fd"   # fd-find
brew "jq"   # JSON processor
brew "mas"  # Mac App Store CLI
brew "gnupg" # GNU Privacy Guard
brew "pinentry-mac" # GnuPG pinentry for macOS
brew "git-who"
brew "gh" # GitHub CLI

# Outils de développement
brew "kubectl"
brew "docker"
brew "ansible"
brew "pnpm"

# Applications via Homebrew Cask
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "orbstack"
cask "warp"
cask "intellij-idea"
cask "spotify"
cask "notion"
cask "discord"
cask "tailscale"
cask "linear-linear"
cask "raycast"
cask "font-fira-code-nerd-font"

# Applications du Mac App Store (nécessite mas)
mas "Xcode", id: 497799835
