# Brewfile - Liste des applications à installer automatiquement

brew update
brew upgrade

# Taps (dépôts supplémentaires)
tap "homebrew/bundle"
tap "homebrew/cask"

# Outils en ligne de commande
brew "git"
brew "stow"
brew "starship"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "nvm"
brew "ripgrep"
brew "fd"   # fd-find
brew "jq"   # JSON processor
brew "mas"  # Mac App Store CLI
brew "gnupg" # GNU Privacy Guard
brew "pinentry-mac" # GnuPG pinentry for macOS
brew "git-who"
brew "gh" # GitHub CLI

# Outils de développement
brew "kubectl"
brew "docker"

# Applications via Homebrew Cask
cask "1password"
cask "1password-cli"
cask "google-chrome"
cask "orbstack"
cask "warp"
cask "visual-studio-code"
cask "spotify"
cask "notion"
cask "discord"
cask "tailscale"
cask "linear-linear"

# Applications du Mac App Store (nécessite mas)
mas "WhatsApp", id: 310633997
mas "Amphetamine", id: 937984704