# Brewfile - Liste des applications à installer automatiquement

# Taps (dépôts supplémentaires)
tap "homebrew/bundle"
tap "homebrew/cask"

# Outils en ligne de commande
brew "git"
brew "stow"
brew "starship"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "nvm"
brew "ripgrep"
brew "fd"   # fd-find
brew "jq"   # JSON processor
brew "mas"  # Mac App Store CLI

# Outils de développement
brew "kubectl"
brew "docker"

# Applications via Homebrew Cask (macOS seulement)
cask "orbstack"              # Alternative Linux: Docker (installé par le script)
cask "warp"                   # Alternative Linux: Terminal natif (GNOME, Konsole, etc.)
cask "visual-studio-code"     # Installé via Snap sur Linux
cask "spotify"                # Installé via Snap sur Linux
cask "notion"                 # Alternative Linux: Version web ou client non-officiel
cask "discord"                # Installé via Snap sur Linux
cask "tailscale"              # Installé via le dépôt apt sur Linux

# Applications du Mac App Store (macOS seulement)
mas "WhatsApp", id: 310633997  # Alternative Linux: Version web